[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science4_33.ipynb)

In [0]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [0]:
dframe1 = DataFrame(np.arange(8).reshape((2,4)),index=pd.Index(['LA','SP'],name='city'),columns=pd.Index(['A','B','C','D'],name='letter'))

In [3]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [4]:
dframe1.stack()

city  letter
LA    A         0
      B         1
      C         2
      D         3
SP    A         4
      B         5
      C         6
      D         7
dtype: int64

In [5]:
type(dframe1.stack())

pandas.core.series.Series

In [0]:
dframe_st = dframe1.stack()

In [7]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SP    A         4
      B         5
      C         6
      D         7
dtype: int64

In [8]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [9]:
dframe_st.unstack(0)

city    LA  SP
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [10]:
dframe_st.unstack('city')

city    LA  SP
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [11]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SP      4  5  6  7

In [0]:
ser1 = Series([0,1,2],index=['Q','X','Y'])
ser2 = Series([4,5,6],index=['X','Y','Z'])

In [0]:
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])

In [14]:
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [15]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [16]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [17]:
dframe.unstack().stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64